Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.3.56/samc20/edc/ATSAMC20J15A.PIC
      <edc:SFRDef edc:_addr="0x4200440E" edc:access="nnnnnnnnnnnnnnnn" edc:cname="WINLT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="WINLT" edc:desc="Window Lower Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004410" edc:access="nnnnnnnnnnnnnnnn" edc:cname="WINUT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="Window Upper Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004412" edc:access="----nnnnnnnnnnnn" edc:cname="GAINCORR" edc:impl="0xFFF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction Value" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004414" edc:access="----nnnnnnnnnnnn" edc:cname="OFFSETCORR" edc:impl="0xFFF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction Value" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004416" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42004418" edc:access="------nn" edc:cname="SWTRIG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="ADC Flush" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START" edc:desc="Start ADC Conversion" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004419" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x4200441C" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200441D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42004420" edc:access="-----rrrrrrrrrrr" edc:cname="SYNCBUSY" edc:impl="0x7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="SWRST Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ENABLE Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INPUTCTRL" edc:desc="INPUTCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLC" edc:desc="CTRLC Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AVGCTRL" edc:desc="AVGCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMPCTRL" edc:desc="SAMPCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINLT" edc:desc="WINLT Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="WINUT Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="GAINCORR Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="OFFSETCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG" edc:desc="SWTRG Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004422" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42004424" edc:access="rrrrrrrrrrrrrrrr" edc:cname="RESULT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="RESULT" edc:desc="Result Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004426" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42004428" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SEQCTRL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="SEQEN" edc:desc="Enable Positive Input in the Sequence" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200442C" edc:access="-----nnn-----nnn" edc:cname="CALIB" edc:impl="0x707" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="BIASCOMP" edc:desc="Bias Comparator Scaling" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BIASREFBUF" edc:desc="Bias Reference Buffer Scaling" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200442E" edc:offset="0xBD2"/>
      <edc:SFRDef edc:_addr="0x42005000" edc:access="------nn" edc:cname="CTRLA" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42005001" edc:access="------ww" edc:cname="CTRLB" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="START0" edc:desc="Comparator 0 Start Comparison" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START1" edc:desc="Comparator 1 Start Comparison" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42005002" edc:access="--nn--nn---n--nn" edc:cname="EVCTRL" edc:impl="0x3313" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMPEO0" edc:desc="Comparator 0 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPEO1" edc:desc="Comparator 1 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WINEO0" edc:desc="Window 0 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="COMPEI0" edc:desc="Comparator 0 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPEI1" edc:desc="Comparator 1 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="INVEI0" edc:desc="Comparator 0 Input Event Invert Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEI1" edc:desc="Comparator 1 Input Event Invert Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42005004" edc:access="---n--nn" edc:cname="INTENCLR" edc:impl="0x13" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:desc="Comparator 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:desc="Comparator 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:desc="Window 0 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42005005" edc:access="---n--nn" edc:cname="INTENSET" edc:impl="0x13" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:desc="Comparator 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:desc="Comparator 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:desc="Window 0 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42005006" edc:access="---n--nn" edc:cname="INTFLAG" edc:impl="0x13" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:desc="Comparator 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:desc="Comparator 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:desc="Window 0" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
